tutorials/darcyFoam/phreeqcRM/calciteDissolutionGypsumPrecipitationPorosityClogging/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
grad(epsSolid)  leastSquares;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind; 
    div(phi,Yi)     Gauss upwind; //vanLeer; //upwind; //bounded Gauss vanLeer; Gamma 0.7
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
    default         none;
//    laplacian((k|mu),p) Gauss linear corrected;
laplacian(-interpolate((k|mu)),p) Gauss linear orthogonal;
laplacian(-Mf,p) Gauss linear orthogonal;
        laplacian(rhorAUf,p)            Gauss linear orthogonal;
    laplacian(muf,U)                    Gauss linear orthogonal;
        laplacian((muf|eps),U)          Gauss linear orthogonal;
    laplacian(Dp,p)                     Gauss linear orthogonal;
    laplacian(nuEff,U)                  Gauss linear orthogonal;
        laplacian((1|A(U)),p)           Gauss linear orthogonal;
        laplacian(Di,Yi)                        Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
    interpolation(HbyA) linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
    p               ;
}

// ************************************************************************* //
